[
  {
    "id": "f661977c-3042-484f-8bef-236846a12cf4",
    "name": "Sue",
    "slug": "sue",
    "title": "Contemporary Artist",
    "biography": "Sue is a contemporary artist whose work explores themes of expression and composition through painting. Her pieces showcase sophisticated technique and creative vision, often working with abstract compositions and mixed media approaches.",
    "portfolioUrl": null,
    "featured": false,
    "createdAt": "2025-06-09T19:01:41.074Z",
    "updatedAt": "2025-06-09T19:01:41.073Z",
    "imageUrl": null
  },
  {
    "id": "71337f8c-afbd-448e-a9d8-9219ba764af8",
    "name": "David",
    "slug": "david",
    "title": "Contemporary Artist",
    "biography": "David is a contemporary artist with new images and works. His practice includes modern works with sophisticated artistic expression.",
    "portfolioUrl": null,
    "featured": false,
    "createdAt": "2025-06-09T19:03:08.971Z",
    "updatedAt": "2025-06-09T19:03:08.971Z",
    "imageUrl": null
  },
  {
    "id": "DJl4pwf0UiVxWdj64u1UI",
    "name": "Roman Nedopaka",
    "slug": "roman-nedopaka",
    "title": "Painter & Fine Artist",
    "biography": "Born in Ukraine and now based in North Wales, Roman Nedopaka is a painter specializing in oil portraiture and figurative work. He trained at the Taras Shevchenko Children's Art School and the National Academy of Fine Arts and Architecture in Kyiv, exhibiting internationally since 2005. Roman's art is distinguished by classical techniques and evocative lighting, and he actively shares his craft through workshops and collaborations in Wales.",
    "portfolioUrl": null,
    "featured": false,
    "createdAt": "2025-05-23T10:52:03.367Z",
    "updatedAt": "2025-05-31T10:51:17.319Z",
    "imageUrl": null
  },
  {
    "id": "Krs_n-ZF4RsY4je0rXj1j",
    "name": "Gareth Nash",
    "slug": "gareth-nash",
    "title": "Contemporary Painter",
    "biography": "From a young age, I have been captivated by the transformative power of clay. My grandmother would buy me brightly coloured plasticine and I spent countless hours modelling horses channelling my emotions into tactile, physical forms. Horses were the first creatures I encountered outside of my family home. Early connection to both horses and clay has profoundly shaped my artistic journey, enabling me to express my inner world with depth. Clay can be used to make functional objects but its ability to shape feelings and emotions through its plasticity is what truly inspires me sparking a lifelong passion for expressing myself in clay.\n\nMy work frequently incorporates animals, particularly horses, as symbols to convey emotions and personal narratives. Clay, with its inherent plasticity, allows me to shape these feelings into tangible forms, creating a dialogue between the inner self and the external world. I explore themes of Gender Dysphoria within my ceramic practice, reflecting narratives from the LGBTQ+ community. Through this work, I aim to use clay as a powerful medium for engaging audiences with profound emotions and compelling imagery to break through stigma and fear.\n\nClay continues to excite me as a vessel for storytelling, connection, self-expression and discussing the human condition.",
    "portfolioUrl": null,
    "featured": true,
    "createdAt": "2025-05-23T10:52:03.268Z",
    "updatedAt": "2025-06-08T20:52:40.214Z",
    "imageUrl": "https://yltxiozrab7hmfqn.public.blob.vercel-storage.com/artworks/1749415959215-GarethNash.jpg"
  },
  {
    "id": "94LWS9TPaKf4QGpbstvlk",
    "name": "Jo-Anna Duncalf",
    "slug": "jo-anna-duncalf",
    "title": "Conceptual Ceramic Artist",
    "biography": "Jo-Anna Duncalf is a Conceptual Ceramic Artist. She grew up in the Conwy Valley and after graduating from Howard Garden's Art School, Cardiff spent two years in Tokoname Japan, where she further extended her knowledge of ceramics, including Raku. After returning to the UK for a short time she travelled to New Zealand, Australia and Thailand, where is held the post of Artist in Residence, producing work for Solo and collaborative exhibitions. This work was based on the Pre dynastic Egyptian Egg form suspended in metal and clay stands. In 1995 Jo-Anna returned to Cardiff Art School to complete her Masters at which time her work became more Conceptual, initially exploring Gender Identity. Jo-Anna has been awarded several National awards and Grants for her work. She has extensive teaching experience and held the position on Head of Art at Chetwynde School, Casterton School, Sedbergh School and Forest School London. She is currently overseeing the Art Programme at Pale Hall, Bala.",
    "portfolioUrl": null,
    "featured": true,
    "createdAt": "2025-05-23T10:52:03.242Z",
    "updatedAt": "2025-06-08T20:53:06.724Z",
    "imageUrl": "https://yltxiozrab7hmfqn.public.blob.vercel-storage.com/artworks/1749415986297-JOANNA.jpg"
  },
  {
    "id": "ETZGB55tz-g3DIqqO3gyK",
    "name": "Andy Dobbie",
    "slug": "andy-dobbie",
    "title": "Mixed Media Artist",
    "biography": "Andy Dobbie is a professional artist living and working in Trearddur Bay on Anglesey. He paints pictures that seek to explore how we make visual sense of the physical world around us. He depicts a range of subjects in a variety of mediums, most recently developing a love of working in oils.\n\nHis artistic journey began in school, when he quickly realised he was not suited to 'A' Level science subjects (and especially Chemistry!) and so swiftly transferred to Art. Discovering a real enthusiasm for the subject, he took a 1 Year Art Foundation course at Coleg Normal in Bangor, where, amongst other things, he was taught drawing by Peter Prendergast and sculpture by Paul Davies.\n\nHere Andy identified an interest in the three dimensional aspects of art but, despite being tempted to pursue sculpture more fully, he elected to pursue a degree in Industrial Design and Production at the Central School of Art and Design in London.\n\nSadly, this proved to be a misstep and Andy returned to Anglesey where he eventually ended up spending his working life in Manufacturing and IT, managing the implementation of complex business systems. During this period he had little opportunity to practice art, although his instinct to reach for a pencil and paper whenever faced with a difficult problem earned him a reputation as 'someone who likes to draw boxes around things'!\n\nAndy was inspired to take up painting again approximately 10 years ago after reading David Hockney's various writings on art, and began spending every spare moment drawing and painting as well as attending local life drawing classes and workshops. He entered and sold work in several group shows and had one piece accepted to the Kyffin Williams Drawing Prize exhibition in 2012.\n\nIn May 2017 he finally took the plunge and gave up his career in IT to pursue his passion for art full time. Since then he has continued to work on improving his artistic practice, and maintains a dedicated 9-5 work ethic, ensuring he is in the studio practicing or creating throughout the working week and beyond.\n\nHe always starts by sketching and painting the figure or landscape from life, before returning to the studio where he seeks to reinterpret those sketches. He sometimes half-jokingly describes himself as a 'sculptor who paints', since he considers his current focus as being to both highlight and undermine the contradictions inherent in depicting three dimensional objects and spaces on the two dimensional picture plane.\n\nAndy participated in his first Anglesey Arts Week Open Studios event in March 2018, during which he conducted several 'ad-hoc' live portrait drawing demos of any visitor who was willing to sit. He was also given the opportunity to conduct a live portrait demo at the Chester Arts Fair in November last year using a volunteer from the audience. More recently, he was invited to give a talk about his artistic journey to the Anglesey Art Group.\n\nAndy has sold work through local shows as well as online galleries and his work is held in private and corporate collections in the UK, Malta, the USA and Australia. He also had another piece accepted to last year's Kyffin Williams Drawing Prize exhibition.\n\nAndy takes inspiration from artists of all eras and movements, but especially from Post-Impressionism onwards and particularly from Cubism which, he feels, still has more to offer figurative artists in the digital age. His artistic heroes include Pablo Picasso, Henri Matisse and David Hockney.",
    "portfolioUrl": null,
    "featured": true,
    "createdAt": "2025-05-23T10:52:03.316Z",
    "updatedAt": "2025-06-15T14:02:09.335Z",
    "imageUrl": "https://yltxiozrab7hmfqn.public.blob.vercel-storage.com/artworks/1749996128785-Portrait.jpg"
  },
  {
    "id": "4ec421de-d804-40a3-97ef-cadeca078633",
    "name": "Marc Duran",
    "slug": "marc-duran",
    "title": "Artist - Marc Duran",
    "biography": "Artist biography for Marc Duran",
    "portfolioUrl": null,
    "featured": false,
    "createdAt": "2025-06-11T18:45:22.127Z",
    "updatedAt": "2025-06-11T18:45:22.127Z",
    "imageUrl": null
  },
  {
    "id": "f342fb4a-ac26-4912-9468-22372d3be2ea",
    "name": "Anthony Gross CBE",
    "slug": "anthony-gross-cbe",
    "title": "Artist - Anthony Gross CBE",
    "biography": "Artist biography for Anthony Gross CBE",
    "portfolioUrl": null,
    "featured": false,
    "createdAt": "2025-06-11T18:45:22.127Z",
    "updatedAt": "2025-06-11T18:45:22.127Z",
    "imageUrl": null
  },
  {
    "id": "21c15a1a-64c6-4693-a769-d5b9eb96397b",
    "name": "CERI RICHARDS CBE",
    "slug": "ceri-richards-cbe",
    "title": "Artist - CERI RICHARDS CBE",
    "biography": "Artist biography for CERI RICHARDS CBE",
    "portfolioUrl": null,
    "featured": false,
    "createdAt": "2025-06-11T18:45:22.127Z",
    "updatedAt": "2025-06-11T18:45:22.127Z",
    "imageUrl": null
  },
  {
    "id": "14a657c7-7e2f-4b0a-bd42-febd0b5afde5",
    "name": "Unknown Artist",
    "slug": "unknown-artist",
    "title": "Unknown Artist",
    "biography": "Works by unidentified artists",
    "portfolioUrl": null,
    "featured": false,
    "createdAt": "2025-06-11T18:45:22.127Z",
    "updatedAt": "2025-06-11T18:45:22.127Z",
    "imageUrl": null
  },
  {
    "id": "f280681d-51e9-4aa2-82bb-668d1cc8d3e9",
    "name": "Steven Page",
    "slug": "steven-page",
    "title": "Contemporary Sculptor",
    "biography": "Steven Page is a contemporary sculptor known for expressive works that capture form and movement in three dimensions.",
    "portfolioUrl": null,
    "featured": false,
    "createdAt": "2025-06-11T18:57:57.846Z",
    "updatedAt": "2025-06-11T18:57:57.846Z",
    "imageUrl": null
  },
  {
    "id": "5b119157-5e21-4892-be03-ce31eed56592",
    "name": "ANEURIN JONES",
    "slug": "aneurin-jones",
    "title": "Artist - ANEURIN JONES",
    "biography": "A Welsh artist whose work explores the intersection of tradition and modernity, drawing inspiration from the landscapes and cultural heritage of Wales.",
    "portfolioUrl": null,
    "featured": false,
    "createdAt": "2025-06-11T18:45:22.127Z",
    "updatedAt": "2025-06-11T18:45:22.127Z",
    "imageUrl": null
  },
  {
    "id": "12c67419-1df9-4249-8d25-e1d297408a43",
    "name": "AUGUSTUS EDWIN MULREADY",
    "slug": "augustus-edwin-mulready",
    "title": "Artist - AUGUSTUS EDWIN MULREADY",
    "biography": "A Victorian-era artist known for his genre paintings and street scenes that captured the everyday life of 19th century Britain with remarkable detail and sensitivity.",
    "portfolioUrl": null,
    "featured": false,
    "createdAt": "2025-06-11T18:45:22.127Z",
    "updatedAt": "2025-06-11T18:45:22.127Z",
    "imageUrl": null
  },
  {
    "id": "fd70477b-bd14-484e-a9a4-6198c72c8cbf",
    "name": "CHARLES WYATT WARREN",
    "slug": "charles-wyatt-warren",
    "title": "Artist - CHARLES WYATT WARREN",
    "biography": "An accomplished painter whose works demonstrate a masterful understanding of light and composition, creating atmospheric pieces that resonate with viewers.",
    "portfolioUrl": null,
    "featured": false,
    "createdAt": "2025-06-11T18:45:22.127Z",
    "updatedAt": "2025-06-11T18:45:22.127Z",
    "imageUrl": null
  },
  {
    "id": "ba13498d-f119-4837-a972-d4acd8c02a6e",
    "name": "CIRCLE OF CHARLES HENRI JOSEPH LEICKERT",
    "slug": "circle-of-charles-henri-joseph-leickert",
    "title": "Artist - CIRCLE OF CHARLES HENRI JOSEPH LEICKERT",
    "biography": "Working in the style of the Dutch master Leickert, this artist continued the tradition of romantic winter landscapes and detailed architectural scenes.",
    "portfolioUrl": null,
    "featured": false,
    "createdAt": "2025-06-11T18:45:22.127Z",
    "updatedAt": "2025-06-11T18:45:22.127Z",
    "imageUrl": null
  },
  {
    "id": "23845cd7-ca12-44a4-ae64-478d5ceb5157",
    "name": "FOLLOWER OF JOHN CLARKSON STANFIELD",
    "slug": "follower-of-john-clarkson-stanfield",
    "title": "Artist - FOLLOWER OF JOHN CLARKSON STANFIELD",
    "biography": "An artist working in the maritime tradition established by Stanfield, creating dramatic seascapes and coastal scenes with exceptional technical skill.",
    "portfolioUrl": null,
    "featured": false,
    "createdAt": "2025-06-11T18:45:22.127Z",
    "updatedAt": "2025-06-11T18:45:22.127Z",
    "imageUrl": null
  },
  {
    "id": "a006b05a-4bd0-4198-8896-58e3256e0b1a",
    "name": "GARETH THOMAS",
    "slug": "gareth-thomas",
    "title": "Artist - GARETH THOMAS",
    "biography": "A contemporary Welsh artist whose innovative approach to traditional subjects has earned recognition for pushing the boundaries of modern Welsh art.",
    "portfolioUrl": null,
    "featured": false,
    "createdAt": "2025-06-11T18:45:22.127Z",
    "updatedAt": "2025-06-11T18:45:22.127Z",
    "imageUrl": null
  },
  {
    "id": "78769261-1e5b-4adf-ab3a-8efd1431ed55",
    "name": "GEORGE ARMFIELD",
    "slug": "george-armfield",
    "title": "Artist - GEORGE ARMFIELD",
    "biography": "Renowned for his animal paintings, particularly dogs in landscape settings, bringing warmth and character to his depictions of rural life.",
    "portfolioUrl": null,
    "featured": false,
    "createdAt": "2025-06-11T18:45:22.127Z",
    "updatedAt": "2025-06-11T18:45:22.127Z",
    "imageUrl": null
  },
  {
    "id": "8a038cda-5310-4609-9c03-62a27c1276af",
    "name": "GWILYM PRICHARD",
    "slug": "gwilym-prichard",
    "title": "Artist - GWILYM PRICHARD",
    "biography": "A notable figure in Welsh art, whose work captures the essence of Welsh identity through bold compositions and a distinctive visual language.",
    "portfolioUrl": null,
    "featured": false,
    "createdAt": "2025-06-11T18:45:22.127Z",
    "updatedAt": "2025-06-11T18:45:22.127Z",
    "imageUrl": null
  },
  {
    "id": "3c956159-7fc4-4383-beb4-d2ffd35e58a7",
    "name": "HELEN ALLINGHAM RWS",
    "slug": "helen-allingham-rws",
    "title": "Artist - HELEN ALLINGHAM RWS",
    "biography": "A pioneering female watercolorist of the Victorian era, celebrated for her cottage gardens and rural scenes that preserved a vanishing way of life.",
    "portfolioUrl": null,
    "featured": false,
    "createdAt": "2025-06-11T18:45:22.127Z",
    "updatedAt": "2025-06-11T18:45:22.127Z",
    "imageUrl": null
  },
  {
    "id": "71c7bc95-1d09-4b02-a0c5-ab4e04e8d73f",
    "name": "HUGH OLOFF DE WET",
    "slug": "hugh-oloff-de-wet",
    "title": "Artist - HUGH OLOFF DE WET",
    "biography": "A sophisticated artist whose work demonstrates influences from both European and colonial traditions, creating a unique artistic vision.",
    "portfolioUrl": null,
    "featured": false,
    "createdAt": "2025-06-11T18:45:22.127Z",
    "updatedAt": "2025-06-11T18:45:22.127Z",
    "imageUrl": null
  },
  {
    "id": "6d195b3a-8f24-4390-892f-7b20c1329930",
    "name": "JOHN BRUNSDON",
    "slug": "john-brunsdon",
    "title": "Artist - JOHN BRUNSDON",
    "biography": "Known for his evocative landscapes and urban scenes, capturing the changing face of Britain with a keen eye for atmosphere and detail.",
    "portfolioUrl": null,
    "featured": false,
    "createdAt": "2025-06-11T18:45:22.127Z",
    "updatedAt": "2025-06-11T18:45:22.127Z",
    "imageUrl": null
  },
  {
    "id": "b65602e7-6c2a-4663-927d-8f118d89d76a",
    "name": "JOHN ELWYN",
    "slug": "john-elwyn",
    "title": "Artist - JOHN ELWYN",
    "biography": "A major figure in 20th century Welsh art, whose expressionist style and vibrant use of color revolutionized the portrayal of Welsh landscapes.",
    "portfolioUrl": null,
    "featured": false,
    "createdAt": "2025-06-11T18:45:22.127Z",
    "updatedAt": "2025-06-11T18:45:22.127Z",
    "imageUrl": null
  },
  {
    "id": "f11a308b-0eac-4d3c-8cac-7b64d6d38d49",
    "name": "JOSEPH THORS",
    "slug": "joseph-thors",
    "title": "Artist - JOSEPH THORS",
    "biography": "A master of pastoral scenes, bringing the English countryside to life with delicate brushwork and an intimate understanding of rural subjects.",
    "portfolioUrl": null,
    "featured": false,
    "createdAt": "2025-06-11T18:45:22.127Z",
    "updatedAt": "2025-06-11T18:45:22.127Z",
    "imageUrl": null
  },
  {
    "id": "86c20cdf-abcd-4009-838d-8588f936f0b3",
    "name": "MAUD SALMON",
    "slug": "maud-salmon",
    "title": "Artist - MAUD SALMON",
    "biography": "A talented artist whose work reflects a deep appreciation for natural forms and subtle color harmonies, creating contemplative and refined compositions.",
    "portfolioUrl": null,
    "featured": false,
    "createdAt": "2025-06-11T18:45:22.127Z",
    "updatedAt": "2025-06-11T18:45:22.127Z",
    "imageUrl": null
  },
  {
    "id": "dd990dac-c2f3-41e3-baab-8393a5bd463b",
    "name": "MEGAN JONES",
    "slug": "megan-jones",
    "title": "Artist - MEGAN JONES",
    "biography": "A contemporary artist exploring themes of identity and place through innovative mixed media techniques and bold visual statements.",
    "portfolioUrl": null,
    "featured": false,
    "createdAt": "2025-06-11T18:45:22.127Z",
    "updatedAt": "2025-06-11T18:45:22.127Z",
    "imageUrl": null
  },
  {
    "id": "5c1de6dc-2aae-4a5f-944f-5a434ef31575",
    "name": "NELSON GRAY KINSLEY",
    "slug": "nelson-gray-kinsley",
    "title": "Artist - NELSON GRAY KINSLEY",
    "biography": "An American artist whose work captures the spirit of the landscape with bold brushwork and a distinctive approach to color and form.",
    "portfolioUrl": null,
    "featured": false,
    "createdAt": "2025-06-11T18:45:22.127Z",
    "updatedAt": "2025-06-11T18:45:22.127Z",
    "imageUrl": null
  },
  {
    "id": "b2b9740c-631a-4de7-a7ca-239687fe1b16",
    "name": "ROGER CECIL",
    "slug": "roger-cecil",
    "title": "Artist - ROGER CECIL",
    "biography": "Known for atmospheric landscapes that capture the subtle moods of nature, bringing a poetic sensibility to traditional subjects.",
    "portfolioUrl": null,
    "featured": false,
    "createdAt": "2025-06-11T18:45:22.127Z",
    "updatedAt": "2025-06-11T18:45:22.127Z",
    "imageUrl": null
  },
  {
    "id": "9da6ce5a-409c-49e0-acd6-5254265bc61d",
    "name": "SIR FRANK BRANGWYN RA",
    "slug": "sir-frank-brangwyn-ra",
    "title": "Artist - SIR FRANK BRANGWYN RA",
    "biography": "A versatile and prolific artist, equally accomplished in painting, drawing, and design, whose bold style influenced a generation of artists.",
    "portfolioUrl": null,
    "featured": false,
    "createdAt": "2025-06-11T18:45:22.127Z",
    "updatedAt": "2025-06-11T18:45:22.127Z",
    "imageUrl": null
  },
  {
    "id": "7452190b-7197-4398-a428-c6a6e772acdb",
    "name": "SIR KYFFIN WILLIAMS RA",
    "slug": "sir-kyffin-williams-ra",
    "title": "Artist - SIR KYFFIN WILLIAMS RA",
    "biography": "The most celebrated Welsh artist of the 20th century, whose powerful landscapes of Snowdonia and Anglesey defined modern Welsh art.",
    "portfolioUrl": null,
    "featured": true,
    "createdAt": "2025-06-11T18:45:22.127Z",
    "updatedAt": "2025-06-11T18:45:22.127Z",
    "imageUrl": null
  },
  {
    "id": "9f88f58b-81ff-465e-bb67-ff2e437eb07c",
    "name": "WARREN WILLIAMS",
    "slug": "warren-williams",
    "title": "Artist - WARREN WILLIAMS",
    "biography": "A contemporary artist whose innovative techniques and fresh perspective bring new energy to traditional subjects and themes.",
    "portfolioUrl": null,
    "featured": false,
    "createdAt": "2025-06-11T18:45:22.127Z",
    "updatedAt": "2025-06-11T18:45:22.127Z",
    "imageUrl": null
  },
  {
    "id": "87f6c287-7ce5-4f93-be10-22010ef81af4",
    "name": "WILL ROBERTS",
    "slug": "will-roberts",
    "title": "Artist - WILL ROBERTS",
    "biography": "A significant figure in Welsh art, whose work documents the industrial and social history of Wales with compassion and artistic skill.",
    "portfolioUrl": null,
    "featured": false,
    "createdAt": "2025-06-11T18:45:22.127Z",
    "updatedAt": "2025-06-11T18:45:22.127Z",
    "imageUrl": null
  },
  {
    "id": "70083dd2-c659-4aaf-9c12-2052fab88676",
    "name": "WILLIAM SHAYER",
    "slug": "william-shayer",
    "title": "Artist - WILLIAM SHAYER",
    "biography": "A prominent member of the English rural painting tradition, creating idyllic scenes of country life with exceptional technical mastery.",
    "portfolioUrl": null,
    "featured": false,
    "createdAt": "2025-06-11T18:45:22.127Z",
    "updatedAt": "2025-06-11T18:45:22.127Z",
    "imageUrl": null
  },
  {
    "id": "03ce9459-4d31-424b-87a4-b341f7a07c62",
    "name": "Susan Cantrill-Williams MA ARCA",
    "slug": "susan-cantrill-williams-ma-arca",
    "title": "Visual Art",
    "biography": "Artist contributing work to the Pale Hall exhibition.",
    "portfolioUrl": "https://share.google/uwVbf94hnC6JfDrXu",
    "featured": false,
    "createdAt": "2025-06-13T16:49:18.436Z",
    "updatedAt": "2025-06-13T16:49:18.436Z",
    "imageUrl": null
  },
  {
    "id": "yfyzb5bXCxl_Use-6h8G2",
    "name": "Alla Chakir",
    "slug": "alla-chakir",
    "title": "Painter & Mixed Media Artist",
    "biography": "Alla Chakir was born in 1955 in the village of Kotlovyna in the Odesa region of Ukraine. Growing up on the banks of a beautiful river, she was profoundly influenced by a childhood memory of watching the scarlet disk of the sun at dawn - a moment that remains etched in her memory and influences her work wherever she travels.\n\nFrom an early age, Alla showed artistic talent, sculpting animals from the multi-colored clay found along the rivershore - blue, yellow, and red. These formative experiences, combined with encouragement from her father who was also an artist, meant there was never any question about her future path.\n\nAlla studied at the Odessa Grekov Art School from 1972 to 1977, mastering ceramics, pastels, and painting. She views painting as an enigma with infinite possibilities, describing it as both \"rest and labor of my soul.\" As a student in 1973, she began actively participating in group exhibitions throughout Ukraine.\n\nHer career milestones include her first solo exhibition in 1997 and membership in the National Union of Artists of Ukraine since 2000. She has participated in numerous exhibitions in Ukraine and abroad, including international art festivals in Canada, France, and the USA.\n\nCurrently residing in North Wales, Alla continues to create paintings and mixed media works, and is available for commissions. She is the mother of artist Roman Nedopaka and collaborates with him on various artworks.",
    "portfolioUrl": null,
    "featured": false,
    "createdAt": "2025-05-23T10:52:03.391Z",
    "updatedAt": "2025-06-15T11:11:03.802Z",
    "imageUrl": "https://yltxiozrab7hmfqn.public.blob.vercel-storage.com/portraits/alla_chakir_portrait-z8lXUd4rTJjYCv6XmQnnOcGD77JyXl.jpeg"
  },
  {
    "id": "b2a45c79-2f28-4e38-a01f-e4fd810a86ec",
    "name": "David Kereszteny Lewis",
    "slug": "david-kereszteny-lewis",
    "title": "Visual Artist",
    "biography": "David Kereszteny Lewis is a contemporary artist whose evocative works capture the essence of Welsh landscapes and coastal environments. His artistic practice is deeply rooted in a connection to place, drawing inspiration from specific locations across Wales. Through careful observation and expressive mark-making, he creates paintings that convey both the physical characteristics and emotional resonance of the landscapes he depicts. His work demonstrates a sophisticated understanding of color, form, and composition, resulting in pieces that are both visually striking and emotionally engaging.",
    "portfolioUrl": "",
    "featured": false,
    "createdAt": "2025-06-15T11:11:01.490Z",
    "updatedAt": "2025-06-15T11:11:01.490Z",
    "imageUrl": "https://yltxiozrab7hmfqn.public.blob.vercel-storage.com/portraits/David_Kereszteny_Lewis_portrait-pmr0E5WJIIGDhAEWW15iuftqlyBL9y.jpeg"
  },
  {
    "id": "f4838c00-6b85-44b2-9911-2c4c9a4e7051",
    "name": "JOSIAH CLINTON JONES",
    "slug": "josiah-clinton-jones",
    "title": "Artist - JOSIAH CLINTON JONES",
    "biography": "An artist whose work bridges traditional and contemporary approaches, creating pieces that speak to both historical craft and modern sensibilities.",
    "portfolioUrl": null,
    "featured": false,
    "createdAt": "2025-06-11T18:45:22.127Z",
    "updatedAt": "2025-06-11T18:45:22.127Z",
    "imageUrl": null
  },
  {
    "id": "b1a02065-bc9c-4ede-b474-3e549e21e6d1",
    "name": "MIKE JONES",
    "slug": "mike-jones",
    "title": "Artist - MIKE JONES",
    "biography": "Working across multiple mediums, this artist creates dynamic pieces that challenge conventional boundaries between abstract and representational art.",
    "portfolioUrl": null,
    "featured": false,
    "createdAt": "2025-06-11T18:45:22.127Z",
    "updatedAt": "2025-06-11T18:45:22.127Z",
    "imageUrl": null
  },
  {
    "id": "3815c69b-c48f-4b85-ad9e-034531dd8d30",
    "name": "PETER OLIVER",
    "slug": "peter-oliver",
    "title": "Artist - PETER OLIVER",
    "biography": "A skilled practitioner whose attention to detail and technical precision creates works of lasting beauty and historical significance.",
    "portfolioUrl": null,
    "featured": false,
    "createdAt": "2025-06-11T18:45:22.127Z",
    "updatedAt": "2025-06-11T18:45:22.127Z",
    "imageUrl": null
  },
  {
    "id": "88603311-d3ea-421a-81e5-6a67c8bab29d",
    "name": "RONALD HERBERT JOHN LAWRENCE",
    "slug": "ronald-herbert-john-lawrence",
    "title": "Artist - RONALD HERBERT JOHN LAWRENCE",
    "biography": "An artist whose work demonstrates a sophisticated understanding of composition and color theory, creating harmonious and engaging visual experiences.",
    "portfolioUrl": null,
    "featured": false,
    "createdAt": "2025-06-11T18:45:22.127Z",
    "updatedAt": "2025-06-11T18:45:22.127Z",
    "imageUrl": null
  },
  {
    "id": "e39fa988-7552-49db-ae7a-02b0d27c6826",
    "name": "WILL EVANS",
    "slug": "will-evans",
    "title": "Artist - WILL EVANS",
    "biography": "An artist known for capturing the essence of place through careful observation and a sensitive approach to light and atmosphere.",
    "portfolioUrl": null,
    "featured": false,
    "createdAt": "2025-06-11T18:45:22.127Z",
    "updatedAt": "2025-06-11T18:45:22.127Z",
    "imageUrl": null
  },
  {
    "id": "8b066e25-47b5-4dde-a56a-04691eb47a5a",
    "name": "WILLIAM TURNER",
    "slug": "william-turner",
    "title": "Artist - WILLIAM TURNER",
    "biography": "Working in the tradition of the great landscape masters, this artist brings a contemporary sensibility to classical subjects.",
    "portfolioUrl": null,
    "featured": false,
    "createdAt": "2025-06-11T18:45:22.127Z",
    "updatedAt": "2025-06-11T18:45:22.127Z",
    "imageUrl": null
  },
  {
    "id": "a399a6b3-2034-40ae-881a-4286beb17de2",
    "name": "Glen Farrelly",
    "slug": "glen-farrelly",
    "title": "ARTIST: Glen Farrelly ARCA",
    "biography": "Glen trained at the renowned Camberwell College of Arts in London, studying for a BA (Hons) fine arts degree in ceramics. He then went on to teach Art at one of the top independent schools in London where he was Head of Art. After 20 years of teaching he moved to California. Here he was exposed to devastating wildfires that almost destroyed his home. Later, when the fires had been declared safe, he returned to his home and walked the fire ravaged sites collecting remnants of scorched and discarded wood. Changing artistic direction and materials Glen began carving and sculpting the burnt wood uncovering their beauty, showing their story, and reassembling to find their future worth. Glen's work has been displayed in exhibitions throughout California, Kuwait, Japan and he is currently showing his work across the UK at various sculpture parks and galleries. Now living in North Wales, he has been accepted as an associate member of the RCA in Conwy. Glen continues to work with reclaimed and storm fallen timber using an ancient Japanese technique called 'Yakisugi'. This method preserves the wood – Yaki means to heat with fire, and sugi is cypress. By slightly charring the surface of the wood without combusting the whole piece, the wood becomes water resistant through the carbonisation and is thus more durable. It also protects against insects, as well as making the wood fire retardant. All Glen's work is sustainable and he only uses natural materials.",
    "portfolioUrl": "https://glenfarrellyartist.com",
    "featured": false,
    "createdAt": "2025-06-15T11:11:02.371Z",
    "updatedAt": "2025-06-15T11:11:02.371Z",
    "imageUrl": "https://yltxiozrab7hmfqn.public.blob.vercel-storage.com/portraits/glen_farrelly_portrait-0KHrQU0gA8EzI9EF10R45KequowHOI.jpg"
  },
  {
    "id": "885cde7b-a900-4ada-a5ce-fd047d693dae",
    "name": "Jon Clayton",
    "slug": "jon-clayton",
    "title": "Visual Art",
    "biography": "Artist contributing work to the Pale Hall exhibition.\n\nJon Clayton. Artist.\n         \nJon’s art is about Places, they can be recognisable, detailed representational images but also, looser, abstract impressions, responses informed by connections present and in memory.\nMany of his paintings depict places of personal significance where he has spent time, often a lot of time. He particularly loves the landscape of Britain. The same small localities he continually returns to. Their familiarity is their strength - it’s what holds and moves him. Revisiting them - walking, running, drawing and photographing - I feel part of something already known. And yet, still, there is always something new, a fresh source of surprise.\nJon lived in mid- Cheshire for many years where his family grew up. The land close by has prompted its own mythology. The fields, woods and trees alongside have sought names and stories from him. Relating to this immediate landscape has also been an important focus and inspiration for painting. He is also a regular visitor to specific places in Wales, where he lived for the past 6 years; Cornwall and the west coast of Scotland.\n After graduating with a BA degree in Creative Arts from Manchester Metropolitan University in 1986, Jon worked briefly as an artist and illustrator for a conservation group. After a number of years as a teacher he continued in education as an Arts Specialist, teaching and delivering workshops for children from primary aged children to young adults studying A-level; students in higher education and adults both in and outside the teaching profession.\nHe uses a range of art media and techniques – maintaining that encouraging others to explore new methods made him open to experimenting and virtually all his work contains mixed media. He also writes and will often include some text in his work\n\nThe core of Jon’s process is about responding to the landscape by drawing. He likes to go to places that have special meaning, where he feels a connection to the landscape. Jon makes many rapid sketches on paper, using a mixture but limited art media. His drawing may incorporate marks, washes and colours that represent objects or features in the landscape or movement and how he feels at the time. He tries not simply to frame what is immediately in front of him but to respond to what grabs his attention, be it near or far away or on the edges of peripheral vision all on the same or many pieces of (usually) paper. However, his practice is evolving and changing all the time.\nIf on a walk Jon may stop and draw at different points along the way, creating a kind of story of the journey in the landscape. These drawing will often be collaged back at the studio - recomposing to create new works that give a feel of the landscape and the day - finding connections in the marks he has made.\nSometimes this is enough and these re-compositions stay in my sketchbook or are framed as fresh, energetic work in their own right.\nSometimes Jon refers to them or parts of them, for fresh larger artworks, using the marks and textures as inspiration referring to drawings and collages - trying to recall the marks and energy, as far as possible, as he builds layers, typically on cradled wood panel or canvas. At this stage although he continues to use inks for their intensity and other mixed media such as charcoal as oil pastel he likes to use more acrylic paint and occasionally oils in thin coats and glazes.\n\nJon has undertaken a wide range of commissions and shows work through gallery representation and exhibition around the country.",
    "portfolioUrl": null,
    "featured": false,
    "createdAt": "2025-06-13T16:49:18.436Z",
    "updatedAt": "2025-06-15T11:11:03.980Z",
    "imageUrl": "https://yltxiozrab7hmfqn.public.blob.vercel-storage.com/portraits/jon_clayton_portrait-qu0I5FTs6myelKAcPNOW3BMYxpcMio.jpg"
  },
  {
    "id": "C0ZBe1VN6JZneugXHLcsR",
    "name": "Mfikela Jean Samuel",
    "slug": "mfikela-jean-samuel",
    "title": "Contemporary Artist",
    "biography": "Mfikela Jean Samuel is a self-taught artist born in Nso village, Cameroon, Central Africa. His artistic journey began with creating art from improvised materials - making paints from locally mined colored rocks, crafting brushes from ox tail hair, and creating pencils from burnt wood.\n\nHis artwork is deeply rooted in African cultural heritage, exploring themes of tradition, resilience, and hope through vibrant colors and expressive strokes. Despite limited resources, Mfikela transformed his creativity into a global artistic career through determination and innovation.\n\nMfikela has exhibited his work in prestigious venues across Wales, including the Millennium Development Centre, National Library of Wales, Oriel Môn Gallery, Storiel, and Pontio. His contributions to the arts have been recognized with several awards, including the Mastering Diversity Award at the Welsh Senedd and honors from the Race Council of Wales and North Wales African Society.\n\nBeyond his artistic practice, Mfikela is a motivational speaker and advocate for talent development among underprivileged youth. He has presented at notable venues including the Welsh Senedd, UK House of Commons, and universities throughout North Wales, sharing his inspiring journey of transforming limited resources into artistic excellence.",
    "portfolioUrl": null,
    "featured": true,
    "createdAt": "2025-05-23T10:52:03.342Z",
    "updatedAt": "2025-06-08T20:24:45.865Z",
    "imageUrl": "https://yltxiozrab7hmfqn.public.blob.vercel-storage.com/artworks/1749414284767-MFIKELA.jpg"
  },
  {
    "id": "47pDab1sG-X7gsJ-OAclk",
    "name": "Nick Elphick",
    "slug": "nick-elphick",
    "title": "Contemporary Sculptor",
    "biography": "Nick Elphick is a sculptor, restorer, and painter based in Llandudno, Wales. His artistic approach is characterized by a passion for traditional skills and creating works that capture the psychological essence of his subjects, bringing \"work to life with a visual impression of the psyche.\"\n\nNick has gained national recognition through his television appearances, being featured on BBC One's \"Extraordinary Portraits\" series where he created a sculpture of an NHS trauma surgeon. He is also a regular participant on the television show \"Salvage Hunters: The Restorers\" on Quest TV, where he demonstrates his restoration expertise.\n\nHis sculptural practice encompasses a diverse range of work including portrait sculptures, wildlife pieces, figurative works, and public commissions. He works across various mediums and scales, from miniature sculptures to large public installations. Notable recent projects include creating a portrait sculpture of RAF veteran Sergeant Brian Latham for his 100th birthday, demonstrating his ability to capture both likeness and character in his commemorative works.\n\nNick's commitment to artistic craftsmanship and storytelling through sculpture has established him as a respected figure in the Welsh arts community, with his work ranging from intimate portraits to significant public commissions.",
    "portfolioUrl": null,
    "featured": true,
    "createdAt": "2025-05-23T10:52:03.217Z",
    "updatedAt": "2025-06-08T20:55:29.240Z",
    "imageUrl": "https://yltxiozrab7hmfqn.public.blob.vercel-storage.com/artworks/1749416128800-NICKELPHICK.jpg"
  },
  {
    "id": "248a65ce-e816-420d-9565-a9a25fbdee77",
    "name": "Steve Page",
    "slug": "steve-page",
    "title": "ARTIST: Steve Page",
    "biography": "Sculptor Stephen Page lives and works in rural Mid Wales. He studied Fine Art, Sculpture at Southampton and specialises in sculpting minimalist animal forms which are cast in bronze through the lost-wax process.",
    "portfolioUrl": "",
    "featured": false,
    "createdAt": "2025-06-15T11:11:03.016Z",
    "updatedAt": "2025-06-15T11:11:03.016Z",
    "imageUrl": "https://yltxiozrab7hmfqn.public.blob.vercel-storage.com/portraits/steve_page_portrait-1hIDBbrzqcTzAw7aWsDtQ9JK4iSwPl.jpg"
  },
  {
    "id": "abed70e7-0996-482e-945f-dcea6d50efbd",
    "name": "Susan Cantrill Williams",
    "slug": "susan-cantrill-williams",
    "title": "ARTIST: Susan Cantrill-Williams MA ARCA",
    "biography": "Susan Cantrill Williams is a distinguished visual artist whose work explores contemporary themes through innovative mixed media approaches. Her artistic practice encompasses a wide range of techniques and materials, creating pieces that engage viewers on multiple levels. As a member of the Royal College of Art (ARCA) and holding a Masters degree, she brings both academic rigor and creative vision to her work. Susan's contributions to the Welsh art scene have been significant, with her pieces featured in numerous exhibitions including the prestigious Pale Hall collection.",
    "portfolioUrl": "https://share.google/uwVbf94hnC6JfDrXu",
    "featured": false,
    "createdAt": "2025-06-15T11:11:03.333Z",
    "updatedAt": "2025-06-15T11:11:03.333Z",
    "imageUrl": "https://yltxiozrab7hmfqn.public.blob.vercel-storage.com/portraits/susan_cantrill_williams_portrait-63iF4gKolVJTqVK7UhiZcWt9mpXgg1.jpeg"
  },
  {
    "id": "yEeYa6nrOAc46fRJknr0F",
    "name": "Steve Tootell",
    "slug": "steve-tootell",
    "title": "Potter & Creative Educator",
    "biography": "Steve has been a pottery maker and teacher for over 45 years. Thirty five of these have been making, teaching and studying pottery in Japan from 1984-2019 whilst working as Head of Creative and Performing Arts at International School of the Sacred Heart, Tokyo. Steve has now returned to Apple Tree Studios in North Wales to concentrate on producing new work and developing his teaching studio at Apple Tree Studios, Denbigh. Steve's primary influences have been British, Indian, Australian, Japanese, Korean, American and Brazilian. Each has given a particular direction and influence to his work. Steve Tootell's work is currently exhibited in galleries in Washington, Tokyo, UK and San Paulo. He has three strands of work coming out of the Denbigh workshop: wood fired earthenware from his large wood kiln (built at Brookhouse Pottery); Raku with Japanese glazes from the gas kiln at Apple Tree Studios and Stoneware and Low Fired Slipware with photo silk screen decoration from the electric kiln at Apple Tree studios Denbigh.",
    "portfolioUrl": null,
    "featured": true,
    "createdAt": "2025-05-23T10:52:03.180Z",
    "updatedAt": "2025-06-08T21:30:29.510Z",
    "imageUrl": "https://yltxiozrab7hmfqn.public.blob.vercel-storage.com/artworks/1749418228244-STEVET.jpg"
  }
]